app/views/dogs/show.html.erb

<p class="indent-10">
  <%= link_to "Update Dog", edit_user_dog_path(current_user, @dog), class: "btn btn-success btn-lg" if current_user.dogs.include?(@dog)%><br><br>
  <%= link_to 'Remove Dog', user_dog_path(current_user, @dog), data: { confirm: 'Are you sure?' }, method: :delete, class: "btn btn-danger btn-lg" if current_user.dogs.include?(@dog)%>
---
SELECT  "dogs".* FROM "dogs" ORDER BY "dogs"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  1 AS one FROM "dogs" WHERE "dogs"."user_id" = ? AND "dogs"."id" = ? LIMIT ?  [["user_id", 19], ["id", 10], ["LIMIT", 1]]