app/views/welcome/welcome.html.erb

SELECT  "play_dates".* FROM "play_dates" ORDER BY created_at desc LIMIT ?  [["LIMIT", 5]]
---
  <ol>
    <% PlayDate.last_five.each do |p| %>