app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.find(session[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def find_user_by_id
      params[:user_id] ? @user = User.find(params[:user_id]) : @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

    def find_user_by_email
      @user = User.find_by(email: params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "f@f.com"], ["LIMIT", 1]]

    def find_dog_by_id
      @dog = Dog.find(params[:id])
---
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]