app/controllers/dog_play_dates_controller.rb

  def destroy
    DogPlayDate.find(params[:id]).destroy
---
DELETE FROM "dog_play_dates" WHERE "dog_play_dates"."id" = ?  [["id", 34]]
SELECT  "dog_play_dates".* FROM "dog_play_dates" WHERE "dog_play_dates"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]