app/controllers/dogs_controller.rb

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
---
    def find_dog_by_id
      @dog = Dog.find(params[:id])