app/controllers/dogs_controller.rb

  def index
    @dogs = User.find(params[:user_id]).dogs
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."user_id" = ?  [["user_id", 13]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]

  def new
    @dog = User.find(params[:user_id]).dogs.build
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT "dogs".* FROM "dogs" WHERE "dogs"."user_id" = ?  [["user_id", 14]]

  def create
    @dog = User.find(params[:user_id]).dogs.build(dog_params)
    if @dog.save
---
SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
INSERT INTO "dogs" ("name", "sex", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "Jazz"], ["sex", "Male"], ["created_at", "2019-02-04 20:41:21.274670"], ["updated_at", "2019-02-04 20:41:21.274670"], ["user_id", 14]]

  def update
    find_dog_by_id
    @dog.update(dog_params)
---
UPDATE "dogs" SET "breed" = ?, "age" = ?, "weight" = ?, "friendly_rating" = ?, "aggressive_rating" = ?, "fixed" = ?, "updated_at" = ? WHERE "dogs"."id" = ?  [["breed", "Pembroke Welsh Corgi"], ["age", 10], ["weight", 24], ["friendly_rating", 10], ["aggressive_rating", 2], ["fixed", 1], ["updated_at", "2019-02-05 22:59:39.405258"], ["id", 8]]

  def destroy
    find_dog_by_id.destroy
---
DELETE FROM "dogs" WHERE "dogs"."id" = ?  [["id", 27]]