app/controllers/play_dates_controller.rb

INSERT INTO "dog_play_dates" ("dog_id", "play_date_id", "note") VALUES (?, ?, ?)  [["dog_id", 10], ["play_date_id", 10], ["note", "ASFAS"]]
INSERT INTO "play_dates" ("location", "date", "time", "dog_limit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["location", "The Best Park"], ["date", "2019-02-20"], ["time", "2000-01-01 17:09:00"], ["dog_limit", 3], ["created_at", "2019-02-11 23:34:16.013770"], ["updated_at", "2019-02-11 23:34:16.013770"]]
---
  def create
    @playdate = PlayDate.new(play_date_params)
    @dogs = current_user.dogs
    if @playdate.save

SELECT "dog_play_dates".* FROM "dog_play_dates" WHERE "dog_play_dates"."play_date_id" = ?  [["play_date_id", 9]]
SELECT  "play_dates".* FROM "play_dates" WHERE "play_dates"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def show
    @playdate = PlayDate.find(params[:id])

SELECT  "play_dates".* FROM "play_dates" WHERE "play_dates"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "dog_play_dates".* FROM "dog_play_dates" WHERE "dog_play_dates"."play_date_id" = ?  [["play_date_id", 7]]
---
  def edit
    @playdate = PlayDate.find(params[:id])

SELECT  "play_dates".* FROM "play_dates" WHERE "play_dates"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "dog_play_dates".* FROM "dog_play_dates" WHERE "dog_play_dates"."play_date_id" = ? AND "dog_play_dates"."id" IN (?, ?)  [["play_date_id", 10], ["id", 19], ["id", 20]]
UPDATE "play_dates" SET "location" = ?, "updated_at" = ? WHERE "play_dates"."id" = ?  [["location", "Desolate Park"], ["updated_at", "2019-02-13 21:00:27.115894"], ["id", 10]]
UPDATE "dog_play_dates" SET "dog_id" = ?, "note" = ? WHERE "dog_play_dates"."id" = ?  [["dog_id", 23], ["note", "I like other dogs!"], ["id", 20]]
---
  def update
    @playdate = PlayDate.find(params[:id])
    @playdate.update(play_date_params)

SELECT "play_dates".* FROM "play_dates"
SELECT "dog_play_dates".* FROM "dog_play_dates" WHERE "dog_play_dates"."play_date_id" = ? AND "dog_play_dates"."id" = ?  [["play_date_id", 11], ["id", 37]]
---
  def index
    @playdates = PlayDate.all

DELETE FROM "play_dates" WHERE "play_dates"."id" = ?  [["id", 9]]
SELECT  "play_dates".* FROM "play_dates" WHERE "play_dates"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def destroy
    PlayDate.find(params[:id]).destroy