app/controllers/play_dates_controller.rb

SELECT "dog_play_dates".* FROM "dog_play_dates" WHERE "dog_play_dates"."play_date_id" = ?  [["play_date_id", 9]]
---
    def find_play_date
      @playdate = PlayDate.find(params[:id])