app/controllers/sessions_controller.rb

INSERT INTO "users" ("email", "password_digest", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "test@test.com"], ["LIMIT", 1]]
---
    def find_or_create_user_from_facebook
      User.find_or_create_by(email: auth['info']['email']) do |u|