app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "mike.dilley@gmail.com"], ["LIMIT", 1]]
---
    def find_user
      @user = User.find_by(email: params[:email])