app/controllers/users_controller.rb

  def show
    @user = User.find_by(params[:id])
---
SELECT  "users".* FROM "users" WHERE (3) LIMIT ?  [["LIMIT", 1]]