app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    find_user_by_id
    @user.update(user_params)
---
UPDATE "users" SET "hobbies" = ?, "age" = ?, "city" = ?, "state" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["hobbies", "Playing with my dog"], ["age", 34], ["city", "Austin"], ["state", "Texas"], ["updated_at", "2019-02-05 23:04:12.845795"], ["id", 14]]

    def find_user_by_id
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]