app/views/play_dates/_play_date_list.html.erb

      <% end %> &nbsp
      <% if current_user.play_dates.include?(p) %>
---
SELECT "play_dates".* FROM "play_dates"