app/views/play_dates/edit.html.erb


      <% elsif current_user.dogs.include?(d.object.dog) %>
---
SELECT "dogs".* FROM "dogs" WHERE "dogs"."user_id" = ?  [["user_id", 14]]