app/views/play_dates/edit.html.erb

SELECT  "dogs".* FROM "dogs" WHERE "dogs"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  1 AS one FROM "dogs" WHERE "dogs"."user_id" = ? AND "dogs"."id" = ? LIMIT ?  [["user_id", 14], ["id", 10], ["LIMIT", 1]]
---
        <%= d.text_area :note %><br>
      <% elsif current_user.dogs.include?(d.object.dog) %>