app/views/play_dates/show.html.erb

<ol>
  <% @playdate.dogs.each do |d| %>
    <li><%= link_to d.name, user_dog_path(d.user, d) %><%= link_to ' <i class="far fa-times-circle"></i>'.html_safe, dog_play_date_path(DogPlayDate.find_by(dog_id: d.id, play_date_id: @playdate.id)), data: { confirm: "Are you sure you want to remove #{d.name} from this playdate?" }, method: :delete, class: "red-link" if current_user.dogs.include?(d)%>
---
SELECT "dogs".* FROM "dogs" INNER JOIN "dog_play_dates" ON "dogs"."id" = "dog_play_dates"."dog_id" WHERE "dog_play_dates"."play_date_id" = ?  [["play_date_id", 7]]
SELECT  1 AS one FROM "dogs" WHERE "dogs"."user_id" = ? AND "dogs"."id" = ? LIMIT ?  [["user_id", 22], ["id", 28], ["LIMIT", 1]]
SELECT  "dog_play_dates".* FROM "dog_play_dates" WHERE "dog_play_dates"."dog_id" = ? AND "dog_play_dates"."play_date_id" = ? LIMIT ?  [["dog_id", 10], ["play_date_id", 10], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT "play_dates".* FROM "play_dates" INNER JOIN "dog_play_dates" ON "play_dates"."id" = "dog_play_dates"."play_date_id" INNER JOIN "dogs" ON "dog_play_dates"."dog_id" = "dogs"."id" WHERE "dogs"."user_id" = ?  [["user_id", 14]]