app/models/play_date.rb

SELECT  "play_dates".* FROM "play_dates" ORDER BY created_at desc LIMIT ?  [["LIMIT", 5]]
---
  def self.last_five
    order("created_at desc").limit(5)